SebastianOberschwendtner/OTOS/mocking/stm32/sdio_stm32_fake.h
    // *** Register Fakes ***
    Fake::Register_t POWER;          /*!< SDIO power control register,    Address offset: 0x00 */
    Fake::Register_t CLKCR;          /*!< SDI clock control register,     Address offset: 0x04 */
    Fake::Register_t ARG;            /*!< SDIO argument register,         Address offset: 0x08 */
    Fake::Register_t CMD;            /*!< SDIO command register,          Address offset: 0x0C */
    Fake::Register_t RESPCMD;        /*!< SDIO command response register, Address offset: 0x10 */
    Fake::Register_t RESP1;          /*!< SDIO response 1 register,       Address offset: 0x14 */
    Fake::Register_t RESP2;          /*!< SDIO response 2 register,       Address offset: 0x18 */
    Fake::Register_t RESP3;          /*!< SDIO response 3 register,       Address offset: 0x1C */
    Fake::Register_t RESP4;          /*!< SDIO response 4 register,       Address offset: 0x20 */
    Fake::Register_t DTIMER;         /*!< SDIO data timer register,       Address offset: 0x24 */
    Fake::Register_t DLEN;           /*!< SDIO data length register,      Address offset: 0x28 */
    Fake::Register_t DCTRL;          /*!< SDIO data control register,     Address offset: 0x2C */
    Fake::Register_t DCOUNT;         /*!< SDIO data counter register,     Address offset: 0x30 */
    Fake::Register_t STA;            /*!< SDIO status register,           Address offset: 0x34 */
    Fake::Register_t ICR;            /*!< SDIO interrupt clear register,  Address offset: 0x38 */
    Fake::Register_t MASK;           /*!< SDIO mask register,             Address offset: 0x3C */
    Fake::Register_t RESERVED0[2];   /*!< Reserved, 0x40-0x44                                  */
    Fake::Register_t FIFOCNT;        /*!< SDIO FIFO counter register,     Address offset: 0x48 */
    Fake::Register_t RESERVED1[13];  /*!< Reserved, 0x4C-0x7C                                  */
    Fake::Register_t FIFO;           /*!< SDIO data FIFO register,        Address offset: 0x80 */
};

// *** Public references to fake peripherals
// Public pointer to SPI peripherals which are faked
extern SDIO_TypeDef *SDIO;
extern std::uintptr_t SDIO_BASE;

#endif